<template>
  <div class="about">
    <h1>This is an about page</h1>
    <p>
      ---
      闲来无事找点事做，那就照着简书搞一个类似的好了，主要是想搞一搞后端如何给前端编写 api ，作为一个前端总是写假数据或者 Mock 数据也不是很好。
      该项目采用前后端分离开发，前端和后端并行开发，后端进度略快，都已经前后端都要开发了，也就不用 Mock 数据那套了。
      目前主要实现了用户模块和文章模块，目前网站的文章数据是使用的 `狗屁不通文章生成器` 生成的，网站中的文章没有任何
      文学价值，仅仅是测试数据，切勿当真。
    </p>
    <p>
      ---
      技术栈的选择
      Vue+axios+Koa+MongoDB
      来看一下技术栈，你问技术栈的选取原则是什么？没什么高大上的理由，唯一的原则是我会用。我太菜了，根本没有给自己留下选择余地，捂脸。
      要看究竟用了啥，可以打开项目根目录下的 `package.json` 查看。
    </p>
    <p>
      ---
      关于接口 接口地址在 http://demo.cemcoe.com/jianshu_api
      因为是测试环境，并没有对访问进行限制，你甚至可以直接使用。
    </p>
    <p>
      ---
      关于测试数据
      如果你不想自己往数据库里添加数据，这里有一份准备好的或者说备份的数据。
      可以从[这里](https://pan.cemcoe.com/jianshu/data/)下载。
    </p>
    <p>
      ---
      关于 UI 框架
      本来想用 UI 框架的，但转念一想，使用 UI 框架的话，前端的乐趣就减少了大半，项目本身又不追求进度啥的，也就不用了。不断地抽离通用组件也是一种乐趣。
    </p>
  </div>
</template>
